# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd
from statsmodels.stats.weightstats import ztest

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents. Please, load the data using Ironhack's database (db: employees, table: employees_advanced).

In [2]:
# Your code here:
salaries = pd.read_csv('../data/Current_Employee_Names__Salaries__and_Position_Titles.csv')
salaries

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
...,...,...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
# Your code here
columnas = ['Name', 'Job Titles', 'Department','Full or Part-Time','Typical Hours','Hourly Rate' ]
salaries_hourly = salaries[columnas]
salaries_hourly

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,NaN,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,NaN,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,NaN,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,NaN,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,20.0,19.86
...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,NaN,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,NaN,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,NaN,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,NaN,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,NaN,NaN

In [5]:
columnas = ['Name', 'Job Titles', 'Department','Full or Part-Time','Annual Salary']
salaries_annual = salaries[columnas]
salaries_annual

,Name,Job Titles,Department,Full or Part-Time,Annual Salary
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,101442.0
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,94122.0
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,101592.0
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,110064.0
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,NaN
...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,72510.0
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,48078.0
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,90024.0
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,93354.0
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,115932.0

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [6]:
# Your code here:
salaries_annual = salaries[salaries['Salary or Hourly']== 'Salary']
salaries_hourly = salaries[salaries['Salary or Hourly']== 'Hourly']

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [7]:
# Your code here:
salaries.groupby('Department').count()['Name']

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [8]:
# Your code here:
#HO: u == 30$/h
#HI: u != 30$/h
#alpha = 1 - 0.95 = 0.05

In [9]:
hypothesis_mean = 30
sample_mean = salaries_hourly['Hourly Rate'].mean()
print(sample_mean)

32.78855771628024

In [10]:
alpha = 0.05

In [11]:
from scipy import stats

In [12]:
#ztest
z_score, p_value = ztest(salaries_hourly['Hourly Rate'], value=hypothesis_mean)

In [13]:
z_score

20.6198057854942

In [14]:
p_value

1.8228873859286195e-94

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [15]:
# Your code here:
salaries_annual_police = salaries_annual[salaries_annual['Department'] == 'POLICE']
salaries_annual_police

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
...,...,...,...,...,...,...,...,...
33177,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

In [16]:
salaries_annual_police['Annual Salary'].mean()

86486.41450313339

In [17]:
# Your code here:
# H0: u < 86.000
# H1: u >= 86.000
# alpha: 0.05

In [18]:
hypothesis_mean = 86000
sample_mean = salaries_annual_police['Annual Salary'].mean()
print(sample_mean)

86486.41450313339

In [19]:
#ztest
#z_score es el numero de desviaciones. 
z_score, p_value = ztest(salaries_annual_police['Annual Salary'], value=hypothesis_mean)

In [20]:
z_score

3.081997005712994

In [21]:
p_value

0.002056169057509571

In [22]:
#p_value es < alpha, por lo que rechazamos la hipotesis nula

Using the `crosstab` function, find the department that has the most hourly workers.

In [23]:
# Your code here:
pd.crosstab(salaries['Department'], salaries['Salary or Hourly']).sort_values(by='Hourly', ascending=False)

Salary or Hourly       Hourly  Salary
Department
STREETS & SAN            1862     336
WATER MGMNT              1513     366
OEMC                     1273     829
AVIATION                 1082     547
GENERAL SERVICES          765     215
TRANSPORTN                725     415
PUBLIC LIBRARY            299     716
FAMILY & SUPPORT          287     328
CITY COUNCIL               64     347
FINANCE                    44     516
LAW                        40     367
ANIMAL CONTRL              19      62
POLICE                     10   13404
MAYOR'S OFFICE              8      77
CULTURAL AFFAIRS            7      58
BUSINESS AFFAIRS            7     164
COMMUNITY DEVELOPMENT       4     203
HUMAN RESOURCES             4      75
HEALTH                      3     485
PROCUREMENT                 2      90
BUDGET & MGMT               2      44
FIRE                        2    4639
ADMIN HEARNG                0      39
BUILDINGS                   0     269
BOARD OF ETHICS             0       8
BOARD OF ELECTION           0     107
CITY CLERK                  0      84
DISABILITIES                0      28
COPA                        0     116
DoIT                        0      99
HUMAN RELATIONS             0      16
LICENSE APPL COMM           0       1
INSPECTOR GEN               0      87
POLICE BOARD                0       2
TREASURER                   0      22

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [24]:
# Your code here:

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [31]:
# Your code here:
from scipy.stats import t
# Calculate the mean and standard error
hourly_rates = salaries[salaries['Salary or Hourly'] == 'Hourly']['Hourly Rate']
mean_hourly = hourly_rates.mean()
std_error_hourly = stats.sem(hourly_rates)

# Calculate the confidence interval
confidence_interval = t.interval(confidence=0.95,          # 95% confidence level
                                 df=len(hourly_rates)-1,   # Degrees of freedom
                                 loc=mean_hourly,          # Mean
                                 scale=std_error_hourly)   # Standard error

# Print
print(f'95% confidence interval for the average hourly wage: {confidence_interval}')

95% confidence interval for the average hourly wage: (32.52345834488425, 33.05365708767623)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [36]:
# Your code here:
salaries_annual_police = salaries[salaries['Salary or Hourly'] == 'Salary']['Annual Salary']

# Calculate the mean and standard error
salaries_annual_police = salaries[salaries['Salary or Hourly'] == 'Hourly']['Hourly Rate']
mean_hourly1 = salaries_annual_police.mean()
std_error_hourly2 = stats.sem(salaries_annual_police)

# Calculate the confidence interval
confidence_interval2 = t.interval(confidence=0.95,          # 95% confidence level
                                  df=len(hourly_rates)-1,   # Degrees of freedom
                                  loc=mean_hourly1,          # Mean
                                  scale=std_error_hourly2)   # Standard error

# Print
print(f'95% confidence interval for the average hourly wage: {confidence_interval}')

95% confidence interval for the average hourly wage: (32.52345834488425, 33.05365708767623)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [27]:
# Your code here: